{"query": "Set an alarm at 4:30 PM on Thursdays for my online meeting.", "intent": "ACTION_SET_ALARM", "uri": "None", "mime": {}, "extras": {"EXTRA_HOUR": 16, "EXTRA_MINUTES": 30, "EXTRA_MESSAGE": "Online Meeting", "EXTRA_DAYS": [5], "EXTRA_RINGTONE": "None", "EXTRA_VIBRATE": false}, "explanation": "This intent sets a recurring alarm for 4:30 PM every Thursday to remind the user about their online meeting.", "id": 1}
{"query": "I need a reminder to pick up the dry cleaning every Friday at 5 PM.", "intent": "ACTION_SET_ALARM", "uri": "None", "mime": {}, "extras": {"EXTRA_HOUR": 17, "EXTRA_MINUTES": 0, "EXTRA_MESSAGE": "Pick up Dry Cleaning", "EXTRA_DAYS": [6], "EXTRA_RINGTONE": "None", "EXTRA_VIBRATE": true}, "explanation": "This intent sets a weekly recurring alarm for 5 PM on Fridays to remind the user to pick up their dry cleaning.", "id": 1}
{"query": "Set a timer for my laundry in 1 hour, ideally with no user interface popping up.", "intent": "ACTION_SET_TIMER", "mime": "", "uri": "None", "extras": {"EXTRA_LENGTH": 3600, "EXTRA_MESSAGE": "Laundry timer", "EXTRA_SKIP_UI": true}, "explanation": "With this intent, a 1-hour laundry timer is set, avoiding any UI interruptions.", "id": 2}
{"query": "I need to time my 5-minute presentation; please set a timer and skip any UI if possible.", "intent": "ACTION_SET_TIMER", "mime": "", "uri": "None", "extras": {"EXTRA_LENGTH": 300, "EXTRA_MESSAGE": "Presentation Timer", "EXTRA_SKIP_UI": true}, "explanation": "A 5-minute timer is created for the presentation, ensuring a distraction-free setup by skipping any UI.", "id": 2}
{"query": "If I want to disable an alarm, how can I quickly find the list of all my alarms?", "intent": "ACTION_SHOW_ALARMS", "mime": {}, "uri": "None", "extras": {}, "explanation": "This intent allows the user to view their alarms so they can easily open and disable any specific alarm.", "id": 3}
{"query": "What alarms do I have set that remind me of daily tasks? Can I see them?", "intent": "ACTION_SHOW_ALARMS", "mime": {}, "uri": "None", "extras": {}, "explanation": "This intent will display all the alarms, allowing the user to check those related to their daily tasks.", "id": 3}
{"query": "I'm looking to reach out to my family members only; how can I select them from my contacts effectively?", "intent": "ACTION_PICK", "mime": "Contacts.CONTENT_TYPE", "uri": null, "extras": {}, "explanation": "Using ACTION_PICK, the user can search or scroll through their contacts to select family members easily.", "id": 7}
{"query": "I need to quickly select a contact to send them an image. How can I do that?", "intent": "ACTION_PICK", "mime": "vnd.android.cursor.dir/contact", "uri": "None", "extras": {}, "explanation": "Utilizing the ACTION_PICK intent allows users to select a contact to whom images can be easily sent.", "id": 7}
{"query": "I need to email my professor about a project. How can I select their email address from my contacts without scrolling too much?", "intent": "ACTION_PICK", "mime": "CommonDataKinds.Email.CONTENT_TYPE", "uri": null, "extras": {}, "explanation": "This intent allows the user to access and pick their professor's email address directly, enhancing convenience.", "id": 8}
{"query": "What do I do if I can't recall my coworker's phone number? Can you assist me in picking it?", "intent": "ACTION_PICK", "mime": "CommonDataKinds.Phone.CONTENT_TYPE", "uri": "None", "extras": {}, "explanation": "This intent lets the user select their coworker's phone number from the contacts effortlessly, solving the problem of forgetting contact details.", "id": 8}
{"query": "I'd like to send a thank-you email to my hiring manager after an interview. His email is hiringmanager@example.com. How should I do this?", "intent": "ACTION_SEND", "mime": "text/plain", "uri": "None", "extras": {"Intent.EXTRA_EMAIL": ["hiringmanager@example.com"], "Intent.EXTRA_SUBJECT": "Thank You for the Opportunity", "Intent.EXTRA_TEXT": "Dear [Hiring Manager's Name], thank you for the interview opportunity. I appreciate your time!"}, "explanation": "This intent makes it easy for the user to express gratitude after an interview by composing a thank-you email.", "id": 13}
{"query": "How can I send a farewell email to my colleagues who I worked with for years? His email is colleagues@example.com.", "intent": "ACTION_SEND", "mime": "text/plain", "uri": "None", "extras": {"Intent.EXTRA_EMAIL": ["colleagues@example.com"], "Intent.EXTRA_SUBJECT": "Farewell and Thank You!", "Intent.EXTRA_TEXT": "It's been great working with you all. I'll miss you!"}, "explanation": "This intent helps the user send a heartfelt farewell email to colleagues, capturing their sentiments.", "id": 13}
{"query": "I need to upload a set of images from a recent trip. Is it possible to select them in bulk?", "intent": "ACTION_GET_CONTENT", "mime": "image/*", "uri": null, "extras": {"EXTRA_ALLOW_MULTIPLE": true}, "explanation": "By allowing multiple selections, the user can easily upload several images from their trip without having to select them one by one.", "id": 15}
{"query": "How can I select several documents at once to print later?", "intent": "ACTION_OPEN_DOCUMENT", "mime": "*/*", "uri": "None", "extras": {"EXTRA_ALLOW_MULTIPLE": true}, "explanation": "This intent enables the user to select multiple document files they intend to print later, ensuring they gather everything required.", "id": 16}
{"query": "Can I select multiple PDF files to send via email at once?", "intent": "ACTION_OPEN_DOCUMENT", "mime": "application/pdf", "uri": "None", "extras": {"EXTRA_ALLOW_MULTIPLE": true}, "explanation": "This intent allows the user to select several PDF files simultaneously, which can then be attached to an email.", "id": 16}
{"query": "I want to take notes during the meeting and save them to a specific folder. How can I do that?", "intent": "ACTION_CREATE_DOCUMENT", "mime": "*/*", "uri": null, "extras": {"EXTRA_TITLE": "Meeting_Notes.txt"}, "explanation": "Users can create a notes document named 'Meeting_Notes.txt' in their selected folder for easy reference.", "id": 17}
{"query": "Can I store some new diagrams I've made for my engineering project in a document?", "intent": "ACTION_CREATE_DOCUMENT", "mime": "*/*", "uri": null, "extras": {"EXTRA_TITLE": "Engineering_Diagrams"}, "explanation": "This intent allows the user to create a document called 'Engineering_Diagrams' to store their project visuals.", "id": 17}
{"query": "I'm organizing a corporate event and need multiple taxis for guests arriving at the same time; can you facilitate this?", "intent": "ACTION_RESERVE_TAXI_RESERVATION", "mime": "", "uri": "", "extras": {}, "explanation": "This intent assists with the logistics of multiple taxis for guests, ensuring a smooth transportation process after the event.", "id": 18}
{"query": "Can you take care of booking a taxi for my kids’ school pick up today?", "intent": "ACTION_RESERVE_TAXI_RESERVATION", "mime": "", "uri": "", "extras": {}, "explanation": "This intent reserves a taxi for the timely pickup of the user's children from school, ensuring their safe return home.", "id": 18}
{"query": "I'd like to visit a well-known art gallery. Please show me where I can find one nearby on the map.", "intent": "ACTION_VIEW", "mime": {}, "uri": "geo:0,0?q=art+gallery", "extras": {}, "explanation": "This intent will show the locations of art galleries in proximity to the user's current location.", "id": 19}
{"query": "What are the common causes of headaches? I need to understand why I might be having them.", "intent": "ACTION_WEB_SEARCH", "mime": {}, "uri": null, "extras": {"SearchManager.QUERY": "common causes of headaches"}, "explanation": "This intent initiates a search for common triggers and causes of headaches.", "id": 27}
{"query": "What are the advantages of meditation for mental health?", "intent": "ACTION_WEB_SEARCH", "mime": {}, "uri": "None", "extras": {"SearchManager.QUERY": "advantages of meditation for mental health"}, "explanation": "The intent triggers a search for information on how meditation benefits mental health.", "id": 27}
{"query": "Help me find the parental control settings. I need to adjust what my kids can access.", "intent": "ACTION_SETTINGS", "mime": {}, "uri": "None", "extras": {}, "explanation": "This intent will redirect the user to the parental control settings, allowing for easy adjustments to restrictions.", "id": 28}
{"query": "How can I manage my sound settings? I find it complicated!", "intent": "ACTION_SETTINGS", "mime": {}, "uri": "None", "extras": {}, "explanation": "This intent will open the sound settings in the system settings app, where the user can easily make changes.", "id": 28}
{"query": "I need to switch my mobile data on for a short time; how do I open those settings?", "intent": "ACTION_WIRELESS_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent lets the user access mobile data settings directly, enabling them to switch mobile data on or off.", "id": 29}
{"query": "I need to troubleshoot my hotspot settings since my friends can't connect. Where do I go?", "intent": "ACTION_WIRELESS_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent takes the user to wireless settings, where they can troubleshoot hotspot configuration.", "id": 29}
{"query": "With all this focus on data privacy, how do I quickly switch to airplane mode?", "intent": "ACTION_AIRPLANE_MODE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent directs the user to airplane mode settings, allowing them to enable it for privacy purposes rapidly.", "id": 30}
{"query": "I have low battery; I want to turn on airplane mode fast. How do I do that?", "intent": "ACTION_AIRPLANE_MODE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent rapidly navigates the user to the airplane mode settings to enable it, conserving battery life.", "id": 30}
{"query": "How can I ensure my device connects to Wi-Fi automatically if I'm near my home?", "intent": "ACTION_WIFI_SETTINGS", "mime": null, "uri": null, "extras": {}, "explanation": "This intent leads the user to the Wi-Fi settings where they can check auto-connect options for saved networks.", "id": 31}
{"query": "I need to reset my router; how can I prepare my Android for reconnection?", "intent": "ACTION_WIFI_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "Using this intent directs the user to the Wi-Fi settings, so they can disconnect from the current network before resetting.", "id": 31}
{"query": "How do I navigate to the APN settings to add custom settings for my device?", "intent": "ACTION_APN_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "The user is taken to the APN settings, enabling them to add custom access point configurations as needed.", "id": 32}
{"query": "I heard there are advanced APN settings that can improve my internet experience; can you take me there?", "intent": "ACTION_APN_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "By utilizing this intent, the user can navigate to the advanced APN settings and make adjustments that can enhance their internet experience.", "id": 32}
{"query": "How can I remove a Bluetooth device that's no longer being used?", "intent": "ACTION_BLUETOOTH_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "By launching the Bluetooth settings, the user can view and unpair devices that they no longer need.", "id": 33}
{"query": "My Bluetooth audio is lagging, and I need to check for any updates. Where should I look?", "intent": "ACTION_BLUETOOTH_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "With this intent, the user can access the Bluetooth settings to check their device’s firmware or software updates.", "id": 33}
{"query": "Can you help me find the date settings on my phone? I can't seem to locate it.", "intent": "ACTION_DATE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent will take the user directly to the date settings screen, eliminating the need for them to search through menus.", "id": 34}
{"query": "My app needs me to set a specific date, but I can't find the date settings. Help me!", "intent": "ACTION_DATE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent directs the user to the date settings interface to enable them to set their desired date.", "id": 34}
{"query": "I have an app that requires my language to be set to Korean. How can I do that?", "intent": "ACTION_LOCALE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent facilitates access to Locale settings, allowing users to change their language to Korean, making the app functional.", "id": 35}
{"query": "I can't find where to change the language settings on my phone. Can you open it for me?", "intent": "ACTION_LOCALE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent helps users who are having trouble finding the language settings by opening the Locale settings directly.", "id": 35}
{"query": "Is there an option to enable predictive text for a different language? Where can I access that?", "intent": "ACTION_INPUT_METHOD_SETTINGS", "mime": "None", "uri": "None", "extras": {}, "explanation": "This intent directs the user to the input method settings where predictive text can be adjusted per language.", "id": 36}
{"query": "Can I customize the keyboard shortcuts? I want faster access to frequently used phrases.", "intent": "ACTION_INPUT_METHOD_SETTINGS", "mime": null, "uri": null, "extras": {}, "explanation": "This intent takes the user to the input method settings where they can customize keyboard shortcuts for ease of use.", "id": 36}
{"query": "Where can I configure my privacy settings to control app permissions?", "intent": "ACTION_DISPLAY_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent opens the settings where users can adjust their privacy settings and manage app permissions.", "id": 37}
{"query": "I want to adjust my device’s PIN settings but can't seem to get the settings panel to open. What should I do?", "intent": "ACTION_SECURITY_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent allows the user to access the device's security settings to modify their PIN settings easily.", "id": 38}
{"query": "I keep getting pop-ups asking for location access; how can I manage this in settings?", "intent": "ACTION_LOCATION_SOURCE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This intent helps users navigate directly to location settings where they can manage app requests for access to their location.", "id": 39}
{"query": "Can you show me how to adjust location settings so my ride-hailing app can locate me better?", "intent": "ACTION_LOCATION_SOURCE_SETTINGS", "mime": "", "uri": "", "extras": {}, "explanation": "This will open the location settings page, allowing the user to adjust privacy and accuracy settings which will enhance their ride-hailing app experience.", "id": 39}
{"query": "I've been getting a lot of notifications about storage issues. How do I manage the storage settings?", "intent": "ACTION_INTERNAL_STORAGE_SETTINGS", "mime": {}, "uri": "None", "extras": {}, "explanation": "This intent leads to storage settings where users can review and manage notifications regarding their device's storage.", "id": 40}
{"query": "I'm trying to clear up space because I'm not able to take photos anymore. Where can I check my storage?", "intent": "ACTION_INTERNAL_STORAGE_SETTINGS", "mime": {}, "uri": "None", "extras": {}, "explanation": "By accessing the internal storage settings, the user can manage and delete items to make space for new photos.", "id": 40}
{"query": "I'm trying to find out how to format my memory card; can you help?", "intent": "ACTION_MEMORY_CARD_SETTINGS", "mime": "", "uri": "None", "extras": {}, "explanation": "This intent opens the memory card settings, allowing the user to format the memory card easily if needed.", "id": 41}
{"query": "I found an amazing recipe and want to send it via SMS to my friend at 444-333-2222. Is that doable?", "intent": "ACTION_SEND", "mime": "text/plain", "uri": "sms:4443332222", "extras": {"sms_body": "Here's a great recipe I found: [recipe_link]"}, "explanation": "This intent allows for sending a text message with a recipe link to your friend's phone.", "id": 43}
