{"query": "I need to set an alarm for 10:30 PM every Sunday to remember to prepare for next week's work."}
{"query": "Set a reminder alarm for me at 12:30 PM for my lunch break tomorrow."}
{"query": "Can I take a picture and have it automatically added to my mobile note-taking app for future reference?"}
{"query": "Set a timer for my laundry in 1 hour, ideally with no user interface popping up."}
{"query": "I want to share a beautiful sunset photo with my friend at 4235678901. How can I do it via SMS/MMS?"}
{"query": "I've been using my device for a long time; I want to perform a thorough review of all storage settings. How do I do that?"}
{"query": "Can I film a short promotional video for my new product and specify the output location?"}
{"query": "I just captured a funny video of my cat acting silly. How do I share that along with a message?"}
{"query": "How do I find my coworker Sara's LinkedIn profile linked in her contact info?"}
{"query": "Can you show me my contacts so I can confirm my dad's postal address for his birthday letter?"}
{"query": "I'd like my phone to prioritize my home network over public ones, where can I set this up?"}
{"query": "I want to quickly retrieve a file from my external storage for editing purposes. How do I do that?"}
{"query": "I want to invite my neighbor over but need her email to send the invitation. Can I pick it from my contacts?"}
{"query": "I want to contact the tech support of my favorite app but don't know their number. How do I find it easily?"}
{"query": "How can I quickly access the APN settings after switching networks?"}
{"query": "I accidentally deleted John’s contact information. Is there a way to retrieve it from somewhere?"}
{"query": "I just saw a recipe online that I tried, and I recorded my cooking steps. I'd like to send it to my sister for fun. How can I do this?"}
{"query": "Where exactly is Buckingham Palace? Can I see it on a map?"}
{"query": "I want to add a fundraising event for charity next month."}
{"query": "What do I do if I can't recall my coworker's phone number? Can you assist me in picking it?"}
{"query": "I'd like to update my colleague's details - specifically their address. What do I do?"}
{"query": "I want to clear out old documents and downloads to free up storage. How do I access those settings?"}
{"query": "I want to make my contact's email address a bit more professional; how do I edit it?"}
{"query": "I need to quickly snap a picture of my child's art project. Can it be saved somewhere accessible?"}
{"query": "I need to capture a behind-the-scenes video of my photoshoot and want it saved in my project folder."}
{"query": "I have some sketches on my device that I want to send to my friend. How can I pick them?"}
{"query": "Set an alarm for 4 PM to remind me to take my medicine."}
{"query": "How can I share a compilation of my hiking photos with my buddies, along with a background story?"}
{"query": "Can I capture a video of my workout session today and store it for later review?"}
{"query": "I need to understand how to adjust my device settings for various languages for a multilingual work environment."}
{"query": "How do I get access to a specific app's data file for some configuration?"}
{"query": "I have some forgotten contacts under my 'Sports Teams' group. Can I see them?"}
{"query": "How do I turn on Bluetooth visibility so my friend can pair their phone with mine?"}
{"query": "I want to find out how to start a vegetable garden at home."}
{"query": "I need to capture a new photo but also want to choose one from my gallery. How can I do both?"}
{"query": "Can you assist me with setting a 90-minute timer for my yoga practice?"}
{"query": "What settings can I adjust on my memory card to improve performance?"}
{"query": "I found some interesting articles that I'd like to share with my classmates via email. Is there a quick way to do this?"}
{"query": "I need to check my bank account online. Can you help me open my bank's website?"}
{"query": "I need to set an alarm for 5 minutes ahead, is that possible?"}
{"query": "I just recorded a video and want to select it for editing. How can I access it directly?"}
{"query": "I want to capture a photo of my pet playing outside, but I need it stored in a specific spot. How do I do that?"}
